{"weightsManifest": [{"paths": ["group1-shard1of1.bin"], "weights": [{"dtype": "float32", "shape": [50, 250], "name": "dense_3/kernel"}, {"dtype": "float32", "shape": [250], "name": "dense_3/bias"}, {"dtype": "float32", "shape": [250, 784], "name": "out/kernel"}, {"dtype": "float32", "shape": [784], "name": "out/bias"}]}], "modelTopology": {"keras_version": "2.2.4-tf", "model_config": {"class_name": "Model", "config": {"layers": [{"class_name": "InputLayer", "inbound_nodes": [], "config": {"dtype": "float32", "batch_input_shape": [1, 50], "name": "input_1", "sparse": false}, "name": "input_1"}, {"class_name": "Dense", "inbound_nodes": [[["input_1", 0, 0, {}]]], "config": {"kernel_initializer": {"class_name": "GlorotUniform", "config": {"dtype": "float32", "seed": null}}, "name": "dense_3", "bias_regularizer": null, "bias_constraint": null, "dtype": "float32", "activation": "relu", "trainable": true, "kernel_constraint": null, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "units": 250, "use_bias": true, "activity_regularizer": null}, "name": "dense_3"}, {"class_name": "Dropout", "inbound_nodes": [[["dense_3", 0, 0, {}]]], "config": {"name": "dropout_1", "dtype": "float32", "trainable": true, "rate": 0.2, "seed": null, "noise_shape": null}, "name": "dropout_1"}, {"class_name": "Dense", "inbound_nodes": [[["dropout_1", 0, 0, {}]]], "config": {"kernel_initializer": {"class_name": "GlorotUniform", "config": {"dtype": "float32", "seed": null}}, "name": "out", "bias_regularizer": null, "bias_constraint": null, "dtype": "float32", "activation": "sigmoid", "trainable": true, "kernel_constraint": null, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "units": 784, "use_bias": true, "activity_regularizer": null}, "name": "out"}], "output_layers": [["out", 0, 0]], "name": "model", "input_layers": [["input_1", 0, 0]]}}, "backend": "tensorflow"}, "generatedBy": "keras v2.2.4-tf", "convertedBy": "TensorFlow.js Converter v1.0.1", "format": "layers-model"}